Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/children_and_young_offenders/diversion_activities_and_programmes_for_young_offenders.html.txt.tmx
Source language: en
Languages: ga

source: Diversion activities and programmes for young offenders
ga: Gníomhaíochtaí athstiúrtha agus cláir d'ógchiontóirí

source: In addition to the Garda Juvenile Diversion Programme there are other programmes which aim to help children understand the consequences of crime and keep them out of the justice system
ga: I dteannta le Clár Athstiúrtha Ógánach an Gharda tá cláir eile ann a bhfuil sé mar aidhm acu cabhrú le páistí torthaí na coireachta a thuiscint agus iad a choinneáil amach as an gcóras ceartais

source: Garda Youth Diversion Projects
ga: Tionscadail Athstiúrtha Óige an Gharda

source: Garda Youth Diversion Projects are administered by the Community Programmes Unit of the Irish Youth Justice Service in cooperation with the Garda Office for Children and Youth Affairs
ga: Riarann Aonad Cláir Phobail Sheirbhís na hÉireann um Cheartas i leith an Aosa Óig, i gcomhoibriú le hOifig an Gharda Síochána um Leanaí agus um Ghnóthaí Óige Tionscadail Athstiúrtha Óige an Gharda Síochána

source: Projects are community based, multi-agency youth crime prevention initiatives which primarily seek to divert young people who have been involved in anti-social and/or criminal behaviour
ga: Tionscnaimh phobalbhunaithe, ilghníomhaireachta um chosc ar ógchoireacht atá sna tionscnaimh, a lorgaíonn go príomha chun daoine óga a athstiúradh ó bheith bainteach in iompar frithshóisialta agus/nó coiriúil

source: The projects provide the children with opportunities to engage in activities such as education, employment training, sport, art and music
ga: Soláthraíonn na tionscadail deiseanna do na leanaí chun tabhairt faoi ghníomhaíochtaí, ar nós oideachais, oiliúint fostaíochta, spóirt, ealaíne agus ceoil

source: Most projects operate outside of school hours, although activities may also be planned during the daytime
ga: Oibrítear an chuid is mó de na tionscadail lasmuigh d’uaireanta scoile, cé go bhféadtar gníomhaíochtaí a phleanáil i rith an lae chomh maith

source: There are approximately 100 projects and they are managed by community based organisations
ga: Tá thart ar 100 tionscadal ann agus bainistíonn eagraíochtaí pobalbhunaithe iad

source: In general, each project is staffed by two youth justice workers
ga: Go ginearálta, bíonn beirt oibrithe um cheartas i leith an aosa óig san fhoireann

source: New Operational Requirements were put in place in January 2011, replacing the 2003 Garda Youth Diversion Project Guidelines and provide a governance framework
ga: Cuireadh Riachtanais Oibríochtúla nua i bhfeidhm in Eanáir 2011, a tháinig in ionad Threoirlínte na dTionscadal Athstiúrtha Óige agus soláthraíonn siad creatlach rialachais

source: Projects are funded by the Department of Justice and Equality
ga: Déanann an Roinn Dlí agus Cirt agus Comhionannais tionscadail a chistiú

source: The Irish Youth Justice Service has published a Progress Report on Garda Youth Diversion Project Development (pdf)
ga: D’fhoilsigh Seirbhís na hÉireann um Cheartas i leith an Aosa Óig Tuarascáil ar Dhul chun Cinn ar Fhorbairt Thionscadail Athstiúrtha Óige an Gharda Síochána (pdf)

source: At school level, the Gardaí operate a programme which is designed to discourage young people from involving themselves in criminal behaviour
ga: Ag leibhéal na scoile, oibríonn na Gardaí clár atá ceaptha chun daoine óige a athchomhairliú gan baint a bheith acu le hiompraíocht choiriúil

source: This programme is called the Schools Programme
ga: Tugtar an Clár Scoileanna ar an gclár seo

source: The programme involves Gardaí visiting classrooms and undertaking projects and trips with pupils in 5th class in primary schools
ga: 'Sé atá i gceist ná go dtugann Gardaí cuairt ar na seomraí ranga agus tugann siad faoi thionscadail agus turais le daltaí i rang a 5 i mbunscoileanna

source: A programme for post-primary schools has been developed to run in conjunction with the Social, Personal and Health Education syllabus for Junior Cycle
ga: Tá clár d' iar-bhunscoileanna forbartha chun feidmhiú i deannta le siollabas an Oideachais Shóisialta, Phearsanta agus Sláinte don tSraith Shóisearach

source: As well as making young people aware of the dangers of criminal behaviour, the Schools Programme also shows children the positive side of the work of the Gardaí and encourages good relations between pupils and the Gardaí
ga: Chomh maith le heolas a thabhairt do dhaoine óige faoi mhíbhuntáistí a bhaineann le hiompraíocht choiriúil, taispeánann an Clár Scoileanna freisin do pháistí an taobh dearfach d'obair na nGardaí agus cuireann sé le dea-chaidreamh idir páistí agus na Gardaí

source: Tel:(01) 666 3823 / 3818
ga: Teil:(01) 666 3823 / 3818
